Repository: ivankruchkoff/media-tags
Catalog: lang/media-tags_*.po
Languages: sr_rs

source: Both Bulk Administration section use some heave JavaScript to accomplish the task. If for some reason this JavaScript interferes with other plugins or borks your WordPress interface you can selectively disable these Bulk Administration options via the <a href="admin.php?page=mediatags_settings_panel">Media-Tags Settings</a> panel.
sr_rs: Odeljak za grupno upravljanje koristi komplikovan JavaScript za izvođenje zadatka. Ako, zbog nečega, JavaScript zasmeta drugim dodacima ili ako ometa rad vašeg WordPress interfejsa, možete selektivno deaktivirati ove opcije grupnog upravljanja putem <a href="admin.php?page=mediatags_settings_panel">Media-Tags Settings</a> panela.

source: By default the Media-Tags plugin creates some custom rewrite rules. These rewrite rules allow you to display archives or Media-Tag terms much like the archive for post tags you may already have on your site. The Media-tags plugin adds a new URL element to your site which is 'media-tags' by default. So if your site URL is http://www.mysite.com/ then the Media-Tags archive will be something like http://www.mysite.com/media-tags/&lt;some term slug&gt;/ The &lt;some term slug&gt; part of the URL will be any given valid Media-Tags slug which contains a number of media items greater than zero.
sr_rs: Po standardu, Media-Tags plugin kreira neka prilagođena pravila ponovljenog pisanja. Ova pravila ponovljenog pisanja omogućavaju vam da prikažete arhive za oznake postova koje možda već imate na svom site-u. Media-tags plugin dodaje novi URL element vašem site-u, a to je 'media-tags' po standardu. Dakle, ako je url vašeg site-a http://www.mysite.com/, onda će Media-Tags arhiva biti nešto kao http://www.mysite.com/media-tags/&lt;some term slug&gt;/. Deo url-a ‘&lt;some term slug&gt; biće bilo koji validan Media-Tags slug koji sadrži broj stavki medija većih od nule.

source: You can change the '/media-tags/' part of the URL. Go to the WordPress admin section. Then into Settings > Permalinks. Toward the bottom of the page in the Optional section you will see an input field to change the '/media-tags/' URL base to something else like gallery, pictures, etc. Just remember this part of the URL must be unique. For example if you already page a WordPress Page in your system named 'Gallery' most likely the URL for that page will also be http://www.mysite.com/gallery/ This means you cannot change '/media-tags/' also to gallery since this means they would share the same URL which is not allowed.
sr_rs: Možete izmeniti '/media-tags/' deo URL-a. Idite na WordPress odeljak za administratore. Zatim idite na opcije Podešavanja > Permalinkovi. Prema kraju stranice, u odeljku ‘Opciono’, videćete polje za unos gde možete zameniti '/media-tags/' URL nečim poput galerija, slika itd. Samo imajte u vidu da ovaj deo URL-a mora biti jedinstven. Npr. ako u svom sistemu već imate WordPress stranicu pod nazivom ‘Galerija’, najverovatnije će URL za tu stranicu takođe biti http://www.mysite.com/gallery/. To znači da ne možete menjati '/oznake medija/' u galeriji jer bi to značilo da bi delili isti url, što nije dozvoljeno.

source: The Media-Tags plugin also supports shortcodes you can add directly to you content. This would allow you to add a selection of images to you page like the WordPress gallery.
sr_rs: Media-Tags plugin takođe podržava shortcode-ove koje možete direktno dodati svom sadržaju. To bi vam omogućilo da svojoj stranici dodate odabrane slike, kao što je WordPress galerija.

source: To use the Media-Tags shortcode you need to open or edit a Post/Page in wp-admin. In the content area you need to first make sure you are on the HTML tab and not the VISUAL tab. Once you are using the HTML tab you can enter the Media-Tags shortcode directly into the content area.
sr_rs: Da biste koristili Media-Tags shortcode, morate da otvorite ili da uredite post/stranicu u wp-admin. U delu za sadržaj prvo proverite da ste na HTML, a ne na VISUAL tabulatoru. Kad se uverite da koristite HTML tab, možete uneti Media-Tags shortcode direktno u oblast sadržaja.

source: In it's simplest form the shortcode for Media-Tags looks something like this:
sr_rs: U svom najjednostavnijem obliku shortcode za Media-Tags izgleda, otprilike, ovako:

source: The beginning part of the shortcode <strong><em>[media-tags</em></strong> is required and indicates to WordPress which shortcode functionality to implement. The next part <strong><em>media_tags="flags"</em></strong> is also required. This element tells the system which Media-Tag terms to display. You can use multiple terms here. These terms need to be comma separated.
sr_rs: Početni deo shortcode-a <strong><em>[media-tags</em></strong> je obavezan i pokazuje WordPress-u koju funkcionalnost shortcode-a treba implementirati. Drugi deo <strong><em>media_tags="flags"</em></strong> je, takođe, obavezan. Ovaj element govori sistemu koje Media-Tag termine treba prikazati. Ovde možete koristiti višestruke termine. Termini moraju biti odvojeni zarezima.

source: Media-Tags support many more optional parameters which are described below. Each parameter below work within the shortcode construct by using the parameter="some value" for example numberposts="10". Most of the parameters used are similar to parmeters used by the WordPress <a target="_blank" href="http://codex.wordpress.org/Template_Tags/get_posts">get_posts</a> function.
sr_rs: Plugin Media-Tags podržava još mnogo opcionih parametara opisanih u nastavku. Svaki parametar funkcioniše unutar konstrukta shortcode-a tako što koristi parametar="neke vrednosti" na primer, za broj postova="10". Većina korišćenih parametara liči na parametre koje upotrebljava <a target="_blank" href="http://codex.wordpress.org/Template_Tags/get_posts">get_posts</a> funkcija.

source: Default is '-1' for all. The number of items (maximum) to display. If you have 51 items tagged 'Flags' and you set numberposts="10" then only 10 will be displayed.
sr_rs: Podrazumevana vrednost je ‘-1’ za sve. Broj stavki za prikazivanje (maksimalan). Ako imate 51 stavku sa oznakom ‘Zastavice’ i podesite broj postova na="10", biće prikazano samo 10.

source: Default is 'OR'. Possible values 'OR' or 'AND'. When passing multiple values for the media_tags parameter this parameter controls how they are compares. An 'OR' compare means all elements which mean one or more of the media_tags values. An 'AND' compare mean only elements which match all values.
sr_rs: Podrazumevana vrednost je ‘ILI’. Moguće vrednosti su ‘ILI’ ili ‘I’. Kad unosite višestruke vrednosti za parametar oznake_medija, ovaj parametar kontroliše njihovo poređenje. Parametar ‘ILI’ znači da se poredi jedan ili više vrednosti oznaka_medija. Parametar ‘I’ znači da se porede samo elementi kojima se poklapaju sve vrednosti.

source: Default is '' for all. Multiple values can be used provided they are separated with commas. You can limit the type of the media elements returned to images, PDF, Excel, etc by using this parameter. There is not a section list of possible values. Some example values are jpg, gif, pdf, excel. Note this compare is done by comparing the File Type determined by WordPress. When you edit a Media item look for the 'File type' field on the form. This is usually something like application/vnd.ms-excel or image/jpeg. You can leave off the beginning part 'application/'.
sr_rs: Podrazumevano je “ za sve. Višestruke vrednosti mogu se koristiti pod uslovom da su odvojene zarezima. Možete ograničiti vrstu elemenata medija koji se vraćaju slikama, PDF, Excel itd. tako što ćete koristiti ovaj parametar. Nema liste za odabir mogućih vrednosti. Neki od primera vrednosti su jpg, gif, pdf, excel. Primetite da se poređenje obavlja u odnosu na vrstu datoteke koju određuje WordPress kad uredite izgled stavke medija za polje ‘Vrsta datoteke’ u obrascu. Obično izgleda ovako: application/vnd.ms-excel or image/jpeg. Možete izostaviti početni deo: 'application/'.

source: Default is 'attachment'. Currently the only possible values for this parameter is 'attachment'.
sr_rs: Podrazumevana vrednost je ‘’prilog’. Trenutno je jedina moguća vrednost za ovaj parametar ‘prilog’.

source: Default is 'menu_order'. Controls the ordering of items displayed. Other possible value(s) are ID,
sr_rs: Podrazumevana vrednost je ‘redosled_menija’. Kontroliše raspoređivanje prikazanih stavki. Ostale moguće vrednosti su: ID,

source: Default 'ASC'. Controls the Ascending (ASC) or Descending (DESC) order of the items.
sr_rs: Podrazumevani ‘RAST’. Kontroliše rastući (RAST.) ili opadajući (OPAD.) redosled stavki menija.

source: Default is '0'. Controls the beginning of the displayed items. If you have 51 items tagged 'Flags' and set the offset="10" then the first 9 items will not be displayed.
sr_rs: Podrazumevana vrednost je ‘0’. Kontroliše početak prikazanih stavki. Ako imate 51 stavku sa oznakom ‘Zastavice’ i ako podesite offset="10", prvih 9 stavki neće biti prikazano.

source: Default 'li'. By default the Media-Tags shortcode will return the items as a list items. There is logic within the shortcode functions to output the wrapping &lt;ul&gt;&lt;/ul&gt; code only if items were found.
sr_rs: Podrazumevana vrednost 'li'. Po standardu, Media-Tags shortcode vratiće stavke kao stavke liste. Postoji logika unutar shortcode funkcija za izlaz umotavanja &lt;ul&gt;&lt;/ul&gt; koda, samo ako su stavke pronađene.

source: Default is 'slug'. No other values are supported.
sr_rs: Podrazumevana vrednost je ‘slug’. Druge vrednosti nisu podržane.

source: The shortcodes functions within the Media-Tags plugin uses a default callback function to display each of the return items from the shortcode selection. You can define your own display function. Look in the plugin folder for the file named 'mediatags_shortcodes.php'. Within this file is a function 'default_item_callback' which can be copied into your own theme's functions.php file. There you can customize the callback function to your needs. You must also rename the function to something other than 'default_item_callback'. Within the Media-Tags shortcode parameters you must set the 'display_item_callback' to call your new function.
sr_rs: Shortcode u okviru Media-Tags plugin-a funkcioniše tako što koristi podrazumevanu funkciju povratnog poziva za prikazivanje svake povratne stavke iz odabira shortcode-a. Možete definisati svoju funkciju prikazivanja. U folderu plugin-a potražite datoteku pod nazivom 'mediatags_shortcodes.php'. U toj datoteci nalazi se funkcija 'default_item_callback' koja se može kopirati u vašu .php datoteku sa funkcijama teme. Tu možete prilagoditi funkciju povratnog poziva svojim potrebama. Morate promeniti naziv funkcije u bilo koji drugi, osim 'default_item_callback'. U okviru Media-Tags shortcode parametara, morate podesiti 'display_item_callback' tako da poziva vašu novu funkciju.

source: Default is 'medium'. Related to the output callback function ad displaying of images in WordPress. As you may know WordPress supports 4 images sizes for your needs thumbnail, medium, large and full.</li> <li><strong>before_list</strong>: Default is '&lt;ul&gt;. You can override this default and use an ordered list or an unordered list with a specific class or id attribute. You can include a h2 header for the title before the list. </li> <li><strong>after_list</strong>: Default is '&lt;/ul&gt;. Obviously this closing element must match the opening element of the 'before_list' parameter.
sr_rs: Podrazumevana vrednost je ‘srednja’. Odnosi se na izlaz funkcije povratnog poziva za prikazivanje slika u WordPress-u. Kao što, možda, znate WordPress podržava 4 veličine slika prema vašim potrebama - sličica, srednja, velika i puna. </li> <li><strong>before_list</strong>: Podrazumevana je '&lt;ul&gt;. Ovu podrazumevanu vrednost možete poništiti i iskoristiti listu sa određenim redosledom ili bez redosleda, sa posebnom klasom ili atributom. Možete uključiti h2 zaglavlje za naslov pre liste. </li> <li><strong>after_list</strong>: Podrazumevana je '&lt;/ul&gt;. Očigledno, taj element zatvaranja mora da se poklapa sa elementom otvaranja parametra 'before_list'.

source: If you know PHP and consider yourself a programmer of sorts then the Media-Tags plugin has a good set of template functions you can also use to access the selection of Media-Tag items. All template related functions are located in the plugin file 'mediatags_template_functions.php'
sr_rs: Ako znate PHP i ako smatrate sebe vrsnim programerom, Media-Tags plugin ima dobar skup funkcija šablona koje možete iskoristiti za pristup određenim Media-Tag stavkama. Sve funkcije u vezi sa šablonom smeštene su u datoteci plugin-a: 'mediatags_template_functions.php'

source: This function works just like the shortcode object in the previous section. But this PHP function allows for better integration and control over the PHP functionality. This function takes an array of key/value pairs like many other WordPress functions. You can refer to the shortcode parameters for the full list of acceptable keys supported.
sr_rs: Ova funkcija radi kao shortcode objekat u prethodnom odeljku. Ali ova PHP funkcija omogućava bolju integraciju i kontrolu nad PHP funkcijama. Ova funkcija koristi niz ključeva/parova vrednosti, kao i mnoge druge WordPress funkcije. Pogledajte shortcode parametre da biste videli celu listu podržanih prihvatljivih ključeva.

source: Functions much like other WordPress is_* functions is_page, is_archive. Returns true is you are viewing a Media-Tags archive page.
sr_rs: Funkcioniše kao i ostale WordPress _* funkcije_stranica, je_arhivirana. Vraća vrednost ‘istina’ ako gledate Media-Tags stranicu za arhiviranje.

source: Similar to the in_category function.
sr_rs: Slično funkciji in_category.

source: Similar to has_tag and has_category functions.
sr_rs: Slično kao funkcije has_tag i has_category

source: Similar to get_categories and get_tags functions.
sr_rs: Slično funkcijama get_categories i get_tags.

source: Returns a list (not array) of Media-Tags terms. Commonly used in the sidebar to list the linked Media-Tags terms.
sr_rs: Vraća listu (ne niz) Media-Tags termina. Obično se koristi u bočnoj traci menija za prikazivanje liste Media-Tags termina.

source: Given a Media-Tags term ID will return the href for that term. There is a second optional argument for returning the RSS version of the link href.
sr_rs: S obzirom na ID Media-Tags termina, vratiće href za taj termin. Postoji i drugi opcioni argument za vraćanje RSS verzije link href-a.

source: Similar to the WordPress function the_tags. Will output a comma separated list of link terms for the viewed attachment. Must be used within the WP loop
sr_rs: Slično kao WordPress funkcija the_tags. Izlaz je lista termina odvojenih zarezima za pregled priloga. Mora se koristiti u WP petlji.

source: Return the Name/Title of currently viewed Media-Tags term. Used like the single_cat_title or single_tag_title functions.
sr_rs: Vraća naziv/naslov Media-Tags termina koji se trenutno posmatra. Koristi se kao funkcije single_cat_title ili single_tag_title.

source: A wrapper to the generic wp_tag_cloud function. All the same parameters are supported.
sr_rs: Omotač generičke wp_tag_cloud funkcije. Podržani su svi isti parametri.

source: Returns the description of a specific Media-Tags term ID if set.
sr_rs: Vraća opis specifičnog ID-ja Media-Tags termina ako je podešen.

source: The selection of which theme template file will be used to display the Media-Tags archives follows the published WordPress Template Hierarchy. the following templates are preferred over the previous listing since these template names are supported by WordPress and not the plugin.
sr_rs: Bira koji će šablon teme biti korišćen za prikazivanje Media-Tags arhiva prateći objavljenu WordPress hijerarhiju šablona. Sledeći šabloni imaju prednost u odnosu na prethodnu listu pošto ove nazive šablona podržava WordPress, ali ne i plugin.

source: In previous version of the Media-Tags plugin there was support for template files from the following listing. These should be considered deprecated over the above listing of WordPress supported template files. If your theme uses the older template filenames you should be able to rename theme to the newer versions without issue.
sr_rs: U prethodnoj verziji Media-Tags plugin-a postojala je podrška za datoteke šablona sa sledeće liste. Trebalo bi ih smatrati manje vrednim od stavki sa gornje liste WordPress podržanih datoteka sa šablonima. Ako vaša tema koristi starije nazive datoteka šablona, trebalo bi da ih preimenujete na novije verzije bez ikakvih problema.

source: example: mediatag-flag.php rename to taxonomy-media-tags-flags.php
sr_rs: primer: mediatag-flag.php preimenuj u: taxonomy-media-tags-flags.php

source: example: mediatag-2.php rename to taxonomy-media-tags-flags.php
sr_rs: primer: mediatag-2.php preimenuj u: taxonomy-media-tags-flags.php

source: rename to taxonomy-media-tags.php
sr_rs: preimenuj u: taxonomy-media-tags.php

source: Similar to the Media-Tags Archive Template files. The plugin also supports the use of an RSS template file. When enabled (See Media-Tags > Settings) a new RSS output will be provided on any Media-Tags archive page. So when the user views your page http://www.mysite.com/media-tags/flags/ they can also subscribe to the RSS fee of this archive by accessing the URL. http://www.mysite.com/media-tags/flags/feed/. This RSS output can be customized by copying the plugin file 'mediatags_rss.php' into your active theme folder. You can disable the automatic RSS feed option via the Media-Tags > Settings panel.
sr_rs: Slično kao Media-Tags datoteke za arhiviranje šablona. Plugin takođe podržava upotrebu RSS datoteke šablona. Kad je aktivirana (vidi: Media-Tags > Podešavanja), novi RSS izlaz biće obezbeđen na bilo kojoj Media-Tags stranici za arhiviranje. Kad korisnik pregleda vašu stranicu http://www.mysite.com/media-tags/flags, može se pretplatiti na RSS feed ove arhive tako što će kliknuti na URL http://www.mysite.com/media-tags/flags/feed/. Ovaj RSS izlaz može se prilagoditi kopiranjem datoteke plugin-a 'mediatags_rss.php' u vaš folder sa aktivnim temama. Možete deaktivirati opciju automatski RSS feed putem panela Media-Tags > Podešavanja.
