Repository: ivankruchkoff/media-tags
Catalog: lang/media-tags_*.po
Languages: sr_rs

# taxonomy general name
source: Media-Tags
sr_rs: Media-Tags [opšti naziv taksonomije]

# taxonomy singular name
source: Media-Tag
sr_rs: Oznaka medija [pojedinačni naziv taksonomije]

# taxonomy search items
source: Search Media-Tags
sr_rs: Pretraži oznake medija [stavke pretrage taksonomije]

# taxonomy popular item
source: Popular Media-Tags
sr_rs: Oznake popularnih medija [taksonomija popularnih stavki]

# taxonomy all items
source: All Media-Tags
sr_rs: Oznake svih medija [taksonomija svih stavki]

# taxonomy parent item
source: Parent Media-Tag
sr_rs: Oznaka nadređenog medija [taksonomija nadređene stavke]

# taxonomy parent item colon
source: Parent Media-Tag:
sr_rs: Oznaka nadređenog medija [kolona taksonomije nadređene stavke]

# taxonomy edit item
source: Edit Media-Tag
sr_rs: Uredi oznaku medija [taksonomija stavke za uređivanje]

# taxonomy update item
source: Update Media-Tag
sr_rs: Ažuriraj oznaku medija [taksonomija stavke za ažuriranje]

# taxonomy add new item
source: Add New Media-Tag
sr_rs: Dodaj novu oznaku medija [taksonomija dodaj novu stavku]

# taxonomy new item name
source: New Media-Tag Name
sr_rs: Naziv oznake novog medija [taksonomija naziva nove stavke]

# column name
source: Media-Tags
sr_rs: Oznake medija [naziv kolone]

source: <p>You must first select which Media Items to change.</p><p>Please close this dialog window and make your selection.</p>
sr_rs: <p>Prvo morate odabrati koje ćete stavke medija promeniti.</p><p>Zatvorite ovaj okvir za dijalog i odaberite stavke.</p>

# bulk admin label
source: Media-Tags
sr_rs: Oznake medija [grupna oznaka administratora]

# bulk admin label
source: Close
sr_rs: Zatvori [grupna oznaka administratora]

# bulk admin label
source: Submit
sr_rs: Podnesi [grupna oznaka administratora]

# bulk admin label
source: Cancel
sr_rs: Otkaži [grupna oznaka administratora]

# bulk admin label
source: Show
sr_rs: Prikaži [grupna oznaka administratora]

# bulk admin label
source: Hide
sr_rs: Sakrij [grupna oznaka administratora]

# bulk admin label
source: All Media-Tags
sr_rs: Oznake svih medija [grupna oznaka administratora]

# menu label
source: Media-Tags
sr_rs: Oznake medija [oznaka menija]

# page label
source: Media-Tags
sr_rs: Oznake medija [oznaka stranice]

# page label
source: Media-Tags Settings
sr_rs: Podešavanja oznaka medija [oznaka stranice]

# menu label
source: Settings
sr_rs: Podešavanja [oznaka menija]

# page label
source: Roles Management
sr_rs: Upravljanje ulogama [oznaka stranice]

# menu label
source: Roles Management
sr_rs: Upravljanje ulogama [oznaka menija]

# page label
source: Third Party Settings
sr_rs: Podešavanja treće strane [oznaka stranice]

# menu label
source: Third Party Settings
sr_rs: Podešavanja treće strane [oznaka menija]

# page label
source: Help
sr_rs: Pomoć [oznaka stranice]

# menu label
source: Help
sr_rs: Pomoć [oznaka menija]

source: All Media-Tags
sr_rs: Sve oznake medija

source: Enter media tags in the space above. Enter multiple tags separated with comma. Or select from the tag(s) below
sr_rs: Unesite oznake medija u gornji prostor. Unesite višestruke oznake odvojene zarezima ili odaberite među sledećim oznakama.

source: Enter media tags in the space above. Enter multiple tags separated with comma.
sr_rs: Unesite oznake medija u gornji prostor. unesite višestruke oznake tako što ćete ih odvojiti zarezima.

source: Media-Tags:
sr_rs: Oznake medija:

# tab label
source: Media Tags
sr_rs: Oznake medija [oznaka tabulatora]

# column name
source: Media Tags
sr_rs: Oznake medija [naziv kolone]

# column name
source: Media Used
sr_rs: Korišćeni mediji [naziv kolone]

source: Bulk Media-Tags Management
sr_rs: Upravljanje grupom oznaka medija

source: Assign or Remove Media Tags from the selected Media items. <strong>Note this action cannot be undone!</strong>
sr_rs: Dodelite ili uklonite oznake medija iz odabranih stavki menija. <strong>Imajte u vidu da se ova aktivnost ne može poništiti!</strong>

source: Number of Media Items Selected:
sr_rs: Broj odabranih stavki medija:

source: Assign Selected items to...
sr_rs: Dodeli odabrane stavke...

source: Remove Selected items from...
sr_rs: Ukloni odabrane stavke iz...

source: Enter new multiple Media Tags separated with comma
sr_rs: Unesite nove višestruke oznake medija odvojene zarezima

source: Select from the media tag(s) below
sr_rs: Odaberite iz sledećih oznaka medija:

source: Update Media-Tags
sr_rs: Ažuriraj oznake medija

# user roles label
source: Manage Media-Tags Settings
sr_rs: Upravljaj podešavanjima oznaka medija [oznaka uloge korisnika]

# user roles label
source: Manage Role/Cap
sr_rs: Upravljaj ulogom/funkcionalnostima [oznaka uloge korisnika]

# user roles label
source: Manage Media-Tags Terms
sr_rs: Upravljaj terminima oznaka medija [oznaka uloge korisnika]

# user roles label
source: Edit Media-Tags Terms
sr_rs: Uredi termine oznaka medija [oznaka uloge korisnika]

# user roles label
source: Delete Media-Tags Terms
sr_rs: Obriši termine oznaka medija [oznaka uloge korisnika]

# user roles label
source: Assign Media-Tags Terms
sr_rs: Dodeli termine oznaka medija [oznaka uloge korisnika]

source: Media-Tags RSS Feed
sr_rs: RSS Feed oznaka medija

source: About this Plugin
sr_rs: O ovom plugin-u

source: Plugin Homepage
sr_rs: Početna stranica plugin-a

source: Make a Donation
sr_rs: Donirajte

source: Show your support of this plugin by making a small donation to support future development. No donation amount too small.
sr_rs: Podržite ovaj plugin tako što ćete priložiti skromnu donaciju da biste podržali budući razvoj. Nijedan iznos nije premali.

source: Make a donation today
sr_rs: Donirajte danas

source: Need Help?
sr_rs: Treba vam pomoć?

source: Media-Tag Help
sr_rs: Pomoć za oznake medija

source: (<i>default is '%s'</i> )<br />
sr_rs: (<i>podrazumevani je'%s'</i> )<br />

source: <strong>Note</strong> Be careful not to use a prefix that may conflict with other WordPress standard prefixes like 'category', 'tag', a Page slug, etc.
sr_rs: <strong>Napomena</strong>Pazite da ne upotrebite prefiks koji bi se mogao sukobiti s drugim WordPress standardnim prefiksima, kao što su: ‘kategorija’, ‘oznaka’, ‘podloška stranice’, itd.

# update message
source: Media-Tags Settings have been updated.
sr_rs: Podešavanja oznaka medija su ažurirana. [poruka o ažuriranju]

# settings panel title
source: Media-Tags Settings
sr_rs: Podešavanja oznaka medija [naziv panela za podešavanja]

source: Media-Tags Bulk Admin Interface
sr_rs: Administratorski interfejs za grupne oznake medija

source: Turn On/Off the Media-Tags Bulk Admin Interfaces. There are two sections where some heavy JavaScript code is added to the page:
sr_rs: Uključi/Isključi administratorske interfejse za grupne oznake medija. Postoje dva odeljka gde se određeni komplikovani JavaScript kod dodaje stranici:

# select option
source: Off
sr_rs: Isključi [odaberi opciju]

source: On
sr_rs: Uključi

source: Media Library Page
sr_rs: Stranica za biblioteku medija

# select option
source: On
sr_rs: Uključi [odaberi opciju]

source: Media Upload Popup (Gallery & Media Library Tabs)
sr_rs: Iskačući prozor za otpremanje medija (Tabulatori: ‘Galerija’ i ‘Biblioteka medija’)

source: Media-Tags Archive Template display
sr_rs: Prikaži šablon arhiviranja oznaka medija

source: When viewing an archive of Media-Tags like http://www.mysite.com/media-tags/some-tag-slug, the default output will be the list of attachments matching the media-tag. If the attachment is an image it will be displayed in the post item body. Using the select option below you can prevent this default action.
sr_rs: Kad gledate arhive oznaka medija, kao što je http://www.mysite.com/media-tags/some-tag-slug, podrazumevani izlaz biće lista priloga koji odgovaraju oznaci medija. Ako je u prilogu slika, biće prikazana u postu. Odabirom opcije koja sledi možete sprečiti podrazumevanu aktivnost.

source: To understand the theme template files used by the Media-Tags plugin visit the help section.
sr_rs: Da biste razumeli datoteke šablona tema koje koristi Media-Tags plugin, posetite deo za pomoć.

# select option
source: No
sr_rs: Ne [odaberi opciju]

source: Yes
sr_rs: Da

source: Use the default Archive Template display?
sr_rs: Koristiti podrazumevani prikaz arhiviranja šablona?

source: RSS Feed for Media-Tags
sr_rs: RSS Feed za Media-Tags

source: The Media-Tags plugin now supports RSS feed when viewing an archive. For example when viewing the URL http://www.mysite.com/media-tags/some-tag/ you can now access the RSS listing by adding '/feed' to the end of the URL as in http://www.mysite.com/media-tags/some-tag/feed/
sr_rs: Media-Tags plugin sad podržava RSS feed za pregledanje arhive. Na primer, kad gledate URL http://www.mysite.com/media-tags/some-tag/ sad možete pristupiti RSS listi tako što ćete dodati '/feed' na kraj URL-a, kao u http://www.mysite.com/media-tags/some-tag/feed/

source: You can customize the RSS output by adding your own Media-Tags RSS template to your theme. Check the topic under the help section.
sr_rs: Možete prilagoditi RSS izlaz tako što ćete dodati svoj Media-Tags RSS šablon svojoj temi. Pročitajte nešto više o ovoj temi u odeljku za pomoć.

source: Turn the Media-Tag RSS Feed option On/Off
sr_rs: Uključite/Isključite opciju Media-Tag RSS Feed

source: Update Options
sr_rs: Ažuriraj opcije

# update message
source: Media-Tags Roles have been updated.
sr_rs: Uloge oznake medija su ažurirane. [poruka o ažuriranju]

# settings panel title
source: Media-Tags Roles Management
sr_rs: Upravljanje ulogama oznaka medija [naziv panela sa podešavanjima]

source: About this page
sr_rs: O ovoj stranici

source: This Settings panel allows control of which users can perform what functions regarding Media-Tags tags. These roles can also be administered via some other popular Role Management plugins.
sr_rs: Zahvaljujući ovom panelu sa podešavanjima korisnici mogu da koriste funkcionalnosti označavanja Media-Tags plugin-a. Ulogama se može upravljati i putem nekih drugih popularnih dodataka za upravljanje ulogama.

source: Roles Legend
sr_rs: Legenda uloga

# role legend label
source: Manage Settings
sr_rs: Upravljaj podešavanjima [oznaka legende uloga]

# role legend text for manage settings
source: Allows the user access to the Media-Tags navigation block. <em>This option excludes access to the Media-Tags Roles Management panel.</em>
sr_rs: Omogućava korisnicima da pristupe bloku za navigaciju Media-Tags dodatka. <em>Ova opcija isključuje pristup panelu za upravljanje ulogama Media-Tags dodatka. </em> [tekst legende uloga za upravljanje podešavanjima]

# role legend label
source: Manage Role/Cap
sr_rs: Upravljaj ulogama/Funkcionalnostima [oznaka legende uloga]

# role legend text for manage roles
source: Allows the user access to the Media-Tags Roles Management panel. (this panel) <em>This option excludes access to the other Media-Tags Settings panels.</em>
sr_rs: Omogućava korisnicima pristup panelu za upravljanje ulogama Media-Tags panela. (ovaj panel) <em>Ova opcija isključuje pristup drugim panelima za podešavanja Media-Tags plugin-a. [tekst legende uloga za upravljanje ulogama]

# role legend label
source: Manage Terms
sr_rs: Upravljaj terminima [oznaka legende uloga]

# role legend text for manage terms
source: Allows users access to manage the 'Media-Tags' menu within the Media navigation block. <em>If this option is set you must also set either 'Edit Terms' or 'Delete Terms' roles.</em>
sr_rs: Omogućava korisnicima da pristupe i uređuju 'Media-Tags' meni unutar bloka za navigaciju medijima. <em>Ako je podešena ova opcija, morate podesiti i uloge ‘Uredi termine’ i ‘Obriši termine’. [tekst legende uloga za upravljanje terminima]

# role legend label
source: Edit Terms
sr_rs: Uredi termine [oznaka legende uloge]

# role legend text for edit terms
source: Allows the user 'Edit' ability within the Media-Tags terms management panel. <em>If you check this option you must also set the 'Manage Terms' Roles option.</em>
sr_rs: Omogućava korisnicima da koriste funkciju ‘Uredi’ na panelu za upravljanje terminima oznaka medija. <em>Ako štiklirate ovu opciju, morate podesiti i opciju ‘Uloge za upravljanje terminima’. </em> [tekst legende uloga za uređivanje termina]

# role legend label
source: Delete Terms
sr_rs: Obriši termine [oznaka legende uloga]

# role legend text for delete terms
source: Allows the user 'Delete' ability within the Media-Tags terms management panel. <em>If you check this option you must also set the 'Manage Terms' Roles option.</em>
sr_rs: Omogućava korisnicima da koriste funkciju ‘Obriši’ u okviru panela za upravljanje terminima oznaka medija. <em>Ako štiklirate ovu opciju, morate podesiti i opciju ‘Uloge za upravljanje terminima’. </em> [tekst legende uloge za brisanje termina]

# role legend label
source: Assign Terms
sr_rs: Dodeli termine [oznaka za legendu uloga]

# role legend text for assign terms
source: Allows the user to assign Media-Tag terms to media items. When set the user will see the 'Media-Tags' fields added to the Media item edit form where you would also see fields for the Title and Caption.
sr_rs: Omogućava korisnicima da dodele termine označavanja medija stavkama medija. Kad je ova opcija podešena, korisnik će videti da su 'Media-Tags' polja dodata formularu za uređivanje stavki medija gde bi inače video polja za Naslov i Opis. [tekst legende uloge za dodelu termina]

source: Role
sr_rs: Uloga

source: Indicats default role catabilities
sr_rs: Pokazuje podrazumevane funkcije uloga

# user role table header
source: ID
sr_rs: ID [zaglavlje tabele uloge korisnika]

# user role table header
source: User (Email)
sr_rs: Korisnik (mail) [zaglavlje tabele uloge korisnika]

# user role table header
source: Manage Settings
sr_rs: Upravljaj podešavanjima [zaglavlje tabele uloge korisnika]

# user role table header
source: Manage Role/Cap
sr_rs: Upravljaj Ulogom/Funkcionalnostima [zaglavlje tabele uloge korisnika]

# user role table header
source: Manage Terms
sr_rs: Upravljaj terminima [zaglavlje tabele uloge korisnika]

# user role table header
source: Edit Terms
sr_rs: Uredi termine [zaglavlje tabele uloge korisnika]

# user role table header
source: Delete Terms
sr_rs: Obriši termine [zaglavlje tabele uloge korisnika]

# user role table header
source: Assign Terms
sr_rs: Dodeli termine [zaglavlje tabele uloge korisnika]

# select option
source: Yes
sr_rs: Da [odaberi opciju]

source: No users at this level.
sr_rs: Nema korisnika na ovom nivou

# update message
source: Media-Tags Third Party Settings have been updated.
sr_rs: Media-Tags podešavanja treće strane su ažurirana [poruka o ažuriranju]

# settings panel title
source: Media-Tags Third Party Support
sr_rs: Media-Tags podrška treće strane [naziv panela za podešavanja]

source: This admin panel provides support functions for Third-Party plugins
sr_rs: Ovaj administratorski panel pruža funkcije podrške za dodatke treće strane

source: Suggest other plugins
sr_rs: Predloži druge dodatke

source: Include Media-Tag URLs in your Google Sitemap XML file? (Requires the install of the
sr_rs: Treba li u vašu Google Sitemap XML datoteku uključiti i Media-Tag URL-ove (Zahteva da se instalira

# settings panel title
source: Media-Tags Help/Support
sr_rs: Media-Tags Pomoć/Podrška [naziv panela sa podešavanjima]

source: This admin panel attempts to put together some of the user question submitted on how to use the Media-Tags plugin
sr_rs: Ovaj administratorski panel pokušava da objedini neka od korisničkih pitanja o tome kako se koristi the Media-Tags plugin

source: Topics
sr_rs: Teme

source: Media-Tags: What does it do?
sr_rs: Media-Tags: Šta radi ovaj plugin?

source: I've assigned some tags to my media uploads. Now what?
sr_rs: Dodelio sam neke oznake svojim otpremljenim medijima. Šta sad?

source: New Bulk Admin interfaces (New in Media-Tags 3.0)
sr_rs: Novi interfejsi za grupu administratora (Novo u Media-Tags 3.0)

source: But how do I display the Media-Tag items on the front-end?
sr_rs: Kako da prikažem Media-Tag stavke na front end-u?

source: Media-Tags and shortcodes
sr_rs: Media-Tags i shortcode-ovi

source: Media-Tags Template Functions
sr_rs: Funkcije Media-Tags šablona

source: Media-Tags Archive Template Hierarchy
sr_rs: Hijerarhija arhiva Media-Tags šablona

source: Media-Tags Template Files RSS
sr_rs: Media-Tags Šabloni RSS datoteka

source: The Media-Tags plugin adds the ability to assign tags to attachments much like how you assign tags and categories to a Post. When you upload a media item (image, PDF, Excel, etc.) in WordPress you are presented with a form to update the Title, Caption, Description, etc for that item. The Media-Tags plugin adds new fields to this form where you can add new or assign existing tags to the media item. When you submit the form the Media-Tags information is stored into a custom Taxonomy as part of the database. This Taxonomy is accessible via any of the standard WordPress user functions.
sr_rs: Media-Tags plugin omogućava dodeljivanje oznaka prilozima na sličan način kao kad postu dodeljujete oznake i kategorije. Kad otpremite stavku medija (sliku, PDF, Excel itd.) u WordPress, dobijate obrazac gde treba da unesete Naslov, Sažetak, Opis i sl. za tu stavku. Media-Tags plugin dodaje nova polja ovom obrascu gde možete dodati nove ili dodeliti postojeće oznake stavki medija. Kad podnesete obrazac, Media-Tags podatak čuva se u prilagođenoj taksonomiji kao deo baze podataka. Taksonomiji se može pristupiti putem bilo koje standardne WordPress korisničke funkcije.

source: Within the WordPress admin interface (/wp-admin) you should see a new menu option under the 'Media' navigation block labelled 'Media-Tags'. This is where you can manage your tags using a familiar interface like the one used for Post Tags. This tag management page will show the Tag name, Description, Slug and how many times the tag is used. If you click on a value in this last column you will be taken to the Media > Library page where you media items are normally listed. But the listing will be filtered to show only those items per that selected Media-Tag. Within the Media > Library page itself there is an additional column added. This column lists the Media-Tags used for the Media Library item.
sr_rs: U okviru WordPress administratorskog interfejsa (/wp-admin) treba da vidite novu opciju menija ispod navigacionog bloka ‘Mediji’ sa oznakom 'Oznake medija'. Ovde možete upravljati svojim oznakama uz pomoć poznatog interfejsa, kao što je onaj za oznake postova. Ova stranica za upravljanje oznakama prikazaće vam naziv oznake, opsi, slug i broj upotrebljenih oznaka. Ako kliknete na vrednost poslednje kolone, odvešće vas na stranicu Mediji > Biblioteka, gde se vaše stavke medija obično prikazuju. Prikazivanje će biti filtrirano tako da ćete videti samo stavke koje je odabrao Media-Tags plugin. Na stranici Mediji > Biblioteka, dodata je još jedna kolona. Ova kolona prikazuje oznake medija korišćene za stavku biblioteke medija.

source: The Media-Tags plugin also supports the new menus system used in WordPress 3.0. If you go to the Appearances > Menus page you will see the Media-Tags listed in the meta boxes on the left side of the page. If you don't see the Media-Tags box try clicking the 'Screen Options' at the top-right of the page. Make sure the Media-Tags is checked.
sr_rs: Media-Tags plugin podržava novi sistem menija koji koristi WordPress 3.0. Ako odete na stranicu Izgled > Meni, videćete oznake medija prikazane u meta-okvirima s leve strane. Ako ne vidite okvir za oznake medija, kliknite na ‘Opcije ekrana’ u gornjem desnom uglu stranice. Proverite da li su štiklirane oznake medija.

source: On the Post/Page editor popup screens where you normally add images and other media items to your system the Media-Tags plugin is also visible. Again, when you add a media item you are presented with the standard WordPress information form to set the Title, Caption, Description, etc. Here you will also see the fields to add or assign Media-Tags to you upload. Also, within the tabbed popup you will see a tab for 'Media Tags'. This tab displays the Media-Tag terms used in your system along with the count use of that term. The count is a link. When click the count will take you to the Media Library tab filtering the displayed items to show those by the selected Media-Tag
sr_rs: Na iskačućim prozorima posta/stranice, gde obično dodajete slike i ostale stavke medija vašem sistemu, videćete i Media-Tags plugin. Kad dodate stavku medija koju predstavljate standardnim WordPress obracem za podešavanje Naslova, Pregleda, Opisa itd, ovde ćete videti polja za otpremanje koja treba da dodate ili kojima treba da dodelite oznake medija. Takođe, u posebnom iskačućem prozoru, videćete tabulator za Media-Tags termine korišćene u vašem sistemu zajedno sa oznakom broja upotreba datog termina. Broj je link. Kad kliknete na broj, odvešće vas na tabulator biblioteke medija sa filtriranim medijima prikazanim na osnovu odabrane oznake medija.

source: Within the WordPress admin interface (/wp-admin) a new Bulk Administration interface has been added to the Media > Library section as well as the Post/Page media popup.
sr_rs: Novi grupni administrativni interfejs dodat je delu Mediji > Biblioteka u okviru WordPress administratorskog interfejsa (/wp-admin), kao i iskačući prozor medija posta/stranice.

source: Within the Media > Library section the Bulk Admin interface is accessed via the WordPress Bulk action dropdown. First you need to select which media items to work with. Then select 'Media-Tags' from the Bulk action dropdown and click the 'Apply' button. You will now see the new Media-Tags Bulk Administration popup. Via this popup you can assign or remove Media-Tag terms from the selected media items. You can also add new Media-Tag terms. Click the 'Submit' button to process. The page will refresh.
sr_rs: U okviru dela Mediji > Biblioteka, možete pristupiti grupnom administratorskom interfejsu putem WordPress opadajućeg menija grupnih aktivnosti. Prvo treba da odaberete s kojim ćete stavkama medija raditi. Zatim odaberite 'Media-Tags' iz opadajućeg menija grupnih aktivnosti i kliknite na taster ‘Primeni’. Sad ćete videti novi iskačući prozor za grupno upravljanje. Zahvaljujući ovom prozoru možete dodeliti ili ukloniti Media-Tag termine iz odabranih stavki medija. Kliknite na taster ‘Podnesi’ da biste pokrenuli proces. Stranica će se ponovo učitati.

source: Within the Post/Page Media popup there is a similar Bulk Administration interface on the 'Galery' or 'Media Library' tabs. Look for the 'Media-Tags: show' link just above the media items listing. Instead of a new popup within a popup this will be an inline panel. On the right side of the media popup there is also a select all checkbox to select all media items. Also within each row of media items there is a checkbox to select just that item.
sr_rs: U iskačućem prozoru mediji posta/stranice postoji sličan grupni administratorski interfejs na tabulatorima ‘Galerija’ ili ‘Biblioteka medija’. Potražite link 'Media-Tags: prikaži' iznad liste stavki medija. Ovo će biti unutrašnji panel umesto posebnog iskačućeg prozora. Na desnoj strani iskačućeg prozora medija prikazano je polje za štikliranje za odabir svih stavki menija istovremeno. Osim toga, u svakom redu stavki menija nalazi se po jedan okvir za štikliranje samo jedne stavke.
